<a href="https://colab.research.google.com/github/WanatchapornS/Data-Preparation-Data-Mining/blob/main/Data_Preparation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Preparation with pandas

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
# Creating a pandas series
data = pd.Series([0, 1, 2, 3, 4, 5, np.nan, 6, 7, 8])

In [ ]:
# To check if and what index in the dataset contains null value
data.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
9    False
dtype: bool

In [ ]:
# To check where the dataset does not contain null value - opposite of isnull()
data.notnull()

0     True
1     True
2     True
3     True
4     True
5     True
6    False
7     True
8     True
9     True
dtype: bool

In [ ]:
# Will not show the index 6 cause it contains null (NaN) value
data.dropna()

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
7    6.0
8    7.0
9    8.0
dtype: float64

In [ ]:
data

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
6    NaN
7    6.0
8    7.0
9    8.0
dtype: float64

In [ ]:
not_null_data = data.dropna()
not_null_data

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
7    6.0
8    7.0
9    8.0
dtype: float64

In [ ]:
# Drop the 6th index in the original 'data' since it has a NaN place
data.dropna(inplace = True)
data

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
7    6.0
8    7.0
9    8.0
dtype: float64

In [ ]:
# Creating a dataframe with 4 rows and 4 columns (4*4 matrix)
data_dim = pd.DataFrame([[1,2,3,np.nan],[4,5,np.nan,np.nan],[7,np.nan,np.nan,np.nan],[np.nan,np.nan,np.nan,np.nan]])
data_dim

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [ ]:
# Drop all rows and columns containing NaN value
data_dim.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [ ]:
# Drop all rows and columns containing entirely of NaN value
data_dim.dropna(how = 'all')

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN

In [ ]:
# Drop only columns that contain entirely NaN value
# Default is 0 - which signifies rows
data_dim.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  7.0  NaN  NaN
3  NaN  NaN  NaN

In [ ]:
# Drop all columns that have more than 2 NaN values
data_dim.dropna(axis = 1, thresh = 2)

     0    1
0  1.0  2.0
1  4.0  5.0
2  7.0  NaN
3  NaN  NaN

In [ ]:
# Drop all rows that have more than 2 NaN values
data_dim.dropna(thresh = 2)

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN

In [ ]:
# Check what the dataset looks like again
data_dim

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [ ]:
# Fill the NaN values with 0
data_dim_fill = data_dim.fillna(0)
data_dim_fill

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  4.0  5.0  0.0  0.0
2  7.0  0.0  0.0  0.0
3  0.0  0.0  0.0  0.0

In [ ]:
# Pass a dictionary to use differnt values for each column
data_dim_fill = data_dim.fillna({0: 0, 1: 8, 2: 9, 3: 10})
data_dim_fill

     0    1    2     3
0  1.0  2.0  3.0  10.0
1  4.0  5.0  9.0  10.0
2  7.0  8.0  9.0  10.0
3  0.0  8.0  9.0  10.0

In [ ]:
# Pass method to determine how to fill-up the column - forward here
data_dim_fill = data_dim.fillna(method='ffill')
data_dim_fill

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  3.0 NaN
2  7.0  5.0  3.0 NaN
3  7.0  5.0  3.0 NaN

In [ ]:
# Pass method to determine how to fill-up the column - forward here
data_dim_fill = data_dim.fillna(method='ffill', limit = 2)
data_dim_fill

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  3.0 NaN
2  7.0  5.0  3.0 NaN
3  7.0  5.0  NaN NaN

In [ ]:
data_dim

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  NaN NaN
2  7.0  NaN  NaN NaN
3  NaN  NaN  NaN NaN

In [ ]:
# Fill the NaN value with mean values in the corresponding column
data_dim_fill = data_dim.fillna(data_dim.mean())
data_dim_fill

     0    1    2   3
0  1.0  2.0  3.0 NaN
1  4.0  5.0  3.0 NaN
2  7.0  3.5  3.0 NaN
3  4.0  3.5  3.0 NaN

## Replacing Values

In [ ]:
data = pd.Series([1,2,-99,4,5,-99,7,8,-99])
data

0     1
1     2
2   -99
3     4
4     5
5   -99
6     7
7     8
8   -99
dtype: int64

In [ ]:
# Replace the placeholder -99 as NaN
data.replace(-99, np.nan)

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
5    NaN
6    7.0
7    8.0
8    NaN
dtype: float64

In [ ]:
# Create a new Series
new_data = pd.Series([-100, 11, 12, 13])
combined_series = pd.concat([data, new_data], ignore_index = True)
combined_series

0       1
1       2
2     -99
3       4
4       5
5     -99
6       7
7       8
8     -99
9    -100
10     11
11     12
12     13
dtype: int64

In [ ]:
# Let's replace -99 and -100 as NaN in the new combined_series
data_replaced = combined_series.replace([-99, -100], np.nan)
data_replaced

0      1.0
1      2.0
2      NaN
3      4.0
4      5.0
5      NaN
6      7.0
7      8.0
8      NaN
9      NaN
10    11.0
11    12.0
12    13.0
dtype: float64

In [ ]:
# Argument passed can also be a dictionary with separate values
data_replaced = combined_series.replace({-99: np.nan, -100: 0})

# Same as: new_data.replace([-99, -100], [np.nan, 0])
data_replaced

0      1.0
1      2.0
2      NaN
3      4.0
4      5.0
5      NaN
6      7.0
7      8.0
8      NaN
9      0.0
10    11.0
11    12.0
12    13.0
dtype: float64

In [ ]:
data_number = pd.DataFrame({'english': ['zero','one','two','three','four','five'],
'digits': [0,1,2,3,4,5]})
data_number

  english  digits
0    zero       0
1     one       1
2     two       2
3   three       3
4    four       4
5    five       5

In [ ]:
english_to_multiple = {
    'two': 'yes',
    'four': 'yes'
}

In [ ]:
# add another column indicating multiples of two as 'Yes' and the rest as 'No'
data_number['multiple'] = data_number['english'].map(english_to_multiple)
data_number

  english  digits multiple
0    zero       0      NaN
1     one       1      NaN
2     two       2      yes
3   three       3      NaN
4    four       4      yes
5    five       5      NaN

## Discretize Data

In [ ]:
import random

data = random.sample(range(1, 101), 30)
data

[24,
 64,
 3,
 13,
 53,
 65,
 46,
 6,
 77,
 11,
 94,
 40,
 30,
 90,
 49,
 48,
 10,
 68,
 58,
 27,
 45,
 67,
 8,
 37,
 54,
 84,
 71,
 59,
 4,
 95]

In [ ]:
# Defining the starting value for each bucket
bucket = [1, 25, 35, 60, 80, 100]

cut_data = pd.cut(data, bucket)
cut_data

[(1, 25], (60, 80], (1, 25], (1, 25], (35, 60], ..., (80, 100], (60, 80], (35, 60], (1, 25], (80, 100]]
Length: 30
Categories (5, interval[int64, right]): [(1, 25] < (25, 35] < (35, 60] < (60, 80] < (80, 100]]

In [ ]:
pd.DataFrame([data,cut_data]).T

     0          1
0   24    (1, 25]
1   64   (60, 80]
2    3    (1, 25]
3   13    (1, 25]
4   53   (35, 60]
5   65   (60, 80]
6   46   (35, 60]
7    6    (1, 25]
8   77   (60, 80]
9   11    (1, 25]
10  94  (80, 100]
11  40   (35, 60]
12  30   (25, 35]
13  90  (80, 100]
14  49   (35, 60]
15  48   (35, 60]
16  10    (1, 25]
17  68   (60, 80]
18  58   (35, 60]
19  27   (25, 35]
20  45   (35, 60]
21  67   (60, 80]
22   8    (1, 25]
23  37   (35, 60]
24  54   (35, 60]
25  84  (80, 100]
26  71   (60, 80]
27  59   (35, 60]
28   4    (1, 25]
29  95  (80, 100]

## Dummy Variables

In [ ]:
# Creating a DataFrame consiting individual characters in the list
data = pd.Series(list('abcdababcdabcd'))
data

0     a
1     b
2     c
3     d
4     a
5     b
6     a
7     b
8     c
9     d
10    a
11    b
12    c
13    d
dtype: object

In [ ]:
pd.get_dummies(data)

    a  b  c  d
0   1  0  0  0
1   0  1  0  0
2   0  0  1  0
3   0  0  0  1
4   1  0  0  0
5   0  1  0  0
6   1  0  0  0
7   0  1  0  0
8   0  0  1  0
9   0  0  0  1
10  1  0  0  0
11  0  1  0  0
12  0  0  1  0
13  0  0  0  1

Source: https://www.datacamp.com/tutorial/data-preparation-with-pandas